# How to import data set in python using pandas liberary
written by: Fatima Afzal\
date: 20.06.2024\
email: fatimanaseem155@gmail.com

In [4]:
#step-1
#importing liberaries
import pandas as pd

In [7]:
#step-2
#reading/importing data
df=pd.read_excel('customer_data.xlsx')
print(df)

   CustomerID  Age  Gender       City  AnnualIncome  PurchaseAmount  \
0         101   25  Female    Karachi        600000           15000
1         102   32    Male     Lahore        850000           22000
2         103   28  Female  Islamabad        720000           18000
3         104   45    Male    Karachi       1200000           40000
4         105   38  Female     Lahore        950000           27000
5         106   22    Male     Multan        450000            9000
6         107   50  Female  Islamabad       1300000           50000
7         108   29    Male    Karachi        780000           20000
8         109   41  Female     Lahore       1100000           35000
9         110   35    Male  Islamabad        900000           26000

  PaymentMethod
0   Credit Card
1    Debit Card
2          Cash
3   Credit Card
4    Debit Card
5          Cash
6   Credit Card
7    Debit Card
8   Credit Card
9          Cash

In [8]:
df.head()

,CustomerID,Age,Gender,City,AnnualIncome,PurchaseAmount,PaymentMethod
0,101,25,Female,Karachi,600000,15000,Credit Card
1,102,32,Male,Lahore,850000,22000,Debit Card
2,103,28,Female,Islamabad,720000,18000,Cash
3,104,45,Male,Karachi,1200000,40000,Credit Card
4,105,38,Female,Lahore,950000,27000,Debit Card

In [10]:
df.tail()

,CustomerID,Age,Gender,City,AnnualIncome,PurchaseAmount,PaymentMethod
5,106,22,Male,Multan,450000,9000,Cash
6,107,50,Female,Islamabad,1300000,50000,Credit Card
7,108,29,Male,Karachi,780000,20000,Debit Card
8,109,41,Female,Lahore,1100000,35000,Credit Card
9,110,35,Male,Islamabad,900000,26000,Cash

In [11]:
#if you want to check about the total number of rows and columns
df.shape

(10, 7)

In [ ]:
#if you want to see specific number of rows in head and tail

df.head(10)

,CustomerID,Age,Gender,City,AnnualIncome,PurchaseAmount,PaymentMethod
0,101,25,Female,Karachi,600000,15000,Credit Card
1,102,32,Male,Lahore,850000,22000,Debit Card
2,103,28,Female,Islamabad,720000,18000,Cash
3,104,45,Male,Karachi,1200000,40000,Credit Card
4,105,38,Female,Lahore,950000,27000,Debit Card
5,106,22,Male,Multan,450000,9000,Cash
6,107,50,Female,Islamabad,1300000,50000,Credit Card
7,108,29,Male,Karachi,780000,20000,Debit Card
8,109,41,Female,Lahore,1100000,35000,Credit Card
9,110,35,Male,Islamabad,900000,26000,Cash

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerID      10 non-null     int64
 1   Age             10 non-null     int64
 2   Gender          10 non-null     object
 3   City            10 non-null     object
 4   AnnualIncome    10 non-null     int64
 5   PurchaseAmount  10 non-null     int64
 6   PaymentMethod   10 non-null     object
dtypes: int64(4), object(3)
memory usage: 692.0+ bytes